Cell 1 â†’ Imports

In [1]:

import pandas as pd
import json

ðŸŸ¢ Cell 2 â†’ Load Customers JSON

In [2]:
with open("customers.json") as f:
    customers_data = json.load(f)

df_customers = pd.DataFrame(customers_data)
df_customers.head()

  CustomerID FirstName LastName Gender      Region          SSN
0      C0001   Gregory   Miller      M        Ohho    082573197
1      C0002    Marvin     None   male  california  309-6256-21
2      C0003   Gregory    Smith   Male   New Yorkk    407071725
3      C0004    Edward    Davis   male        Ohho  948.18.5740
4      C0005  Reginald   Dawson   male       Texas  975.72.3056

ðŸŸ¢ Cell 3 â†’ Load Products CSV

In [3]:
df_products = pd.read_csv("products.csv")
df_products.head()

   ProductID      ProductName         Category
0       1000  Washing Machine  Home Appliances
1       1001     Refrigerator  Home Appliances
2       1002          Blender  Home Appliances
3       1003        Microwave  Home Appliances
4       1004   Vacuum Cleaner  Home Appliances

ðŸŸ¢ Cell 4 â†’ Load Sales CSV

In [4]:
df_sales = pd.read_csv("sales 1.csv")
df_sales.head()

,SaleID,ProductID,CustomerID,SalesAmount,Quantity,Timestamp
0,c0078cd1-3ddc-439a-b41d-7498e8e75e62,1020,C0460,1639.10,18.0,2024-08-09T20:21:00
1,be8532af-16b7-432c-a13d-4c6e6836d12d,1029,C0198,186.11,42.0,2024-11-28T05:01:00
2,8666f277-cc58-4fde-9d58-697da9e040f2,1012,C0524,1712.72,49.0,2024-10-13T00:36:00
3,383e0a2b-7e00-454e-a269-b2f73ecd33f2,1016,C0285,NaN,50.0,2024-07-06T23:39:00
4,d9a7f974-9572-48dd-aa36-3f96b280dfc7,1021,C0369,66.36,21.0,2024-06-08T19:58:00

ðŸŸ¢ Cell 5 â†’ Data Inspection

In [7]:
print(df_customers.info())
print(df_products.info())
print(df_sales.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1100 entries, 0 to 1099
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  1100 non-null   object
 1   FirstName   1100 non-null   object
 2   LastName    780 non-null    object
 3   Gender      1100 non-null   object
 4   Region      1031 non-null   object
 5   SSN         1100 non-null   object
dtypes: object(6)
memory usage: 51.7+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductID    50 non-null     int64
 1   ProductName  50 non-null     object
 2   Category     50 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SaleID       10000 non-null  object
 1   ProductID    10000 non-null  int64
 2   CustomerID   10000 non-null  object
 3   SalesAmount  9503 non-null   float64
 4   Quantity     9887 non-null   float64
 5   Timestamp    10000 non-null  object
dtypes: float64(2), int64(1), object(3)
memory usage: 468.9+ KB
None

Check Columns

In [8]:
print(df_customers.columns)
print(df_products.columns)
print(df_sales.columns)

Index(['CustomerID', 'FirstName', 'LastName', 'Gender', 'Region', 'SSN'], dtype='object')
Index(['ProductID', 'ProductName', 'Category'], dtype='object')
Index(['SaleID', 'ProductID', 'CustomerID', 'SalesAmount', 'Quantity',
       'Timestamp'],
      dtype='object')

âœ… Missing Data Check

In [9]:
print(df_customers.isnull().sum())
print(df_products.isnull().sum())
print(df_sales.isnull().sum())

CustomerID      0
FirstName       0
LastName      320
Gender          0
Region         69
SSN             0
dtype: int64
ProductID      0
ProductName    0
Category       0
dtype: int64
SaleID           0
ProductID        0
CustomerID       0
SalesAmount    497
Quantity       113
Timestamp        0
dtype: int64

Check Duplicates

In [10]:
print(df_customers.duplicated().sum())
print(df_products.duplicated().sum())
print(df_sales.duplicated().sum())

100
0
0

âœ… Timestamp â†’ DateTime

In [11]:
df_sales['Timestamp'] = pd.to_datetime(df_sales['Timestamp'])

âœ… Numeric Columns

In [13]:
df_sales['SalesAmount'] = df_sales['SalesAmount'].astype(float)
df_sales['Quantity'] = df_sales['Quantity'].astype('Int64')

Data Summary

In [14]:
print("Customers:", df_customers.shape)
print("Products:", df_products.shape)
print("Sales:", df_sales.shape)

Customers: (1100, 6)
Products: (50, 3)
Sales: (10000, 6)